IdeaRS.Connections
ConnectionData.AddBeam Method (Int32, Guid, ConnectionCmdData)
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "M:IdeaRS.Connections.Data.ConnectionData.AddBeam(System.Int32,System.Guid,IdeaRS.Connections.Data.ConnectionCmdData)"]
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ManufacturingOperationData AddBeam(
	int operationId,
	Guid commandId,
	ConnectionCmdData commandData
)
Parameters
operationId
Type: Int32
[Missing <param name="operationId"/> documentation for "M:IdeaRS.Connections.Data.ConnectionData.AddBeam(System.Int32,System.Guid,IdeaRS.Connections.Data.ConnectionCmdData)"]
commandId
Type: Guid
[Missing <param name="commandId"/> documentation for "M:IdeaRS.Connections.Data.ConnectionData.AddBeam(System.Int32,System.Guid,IdeaRS.Connections.Data.ConnectionCmdData)"]
commandData
Type: IdeaRS.Connections.Data.ConnectionCmdData
[Missing <param name="commandData"/> documentation for "M:IdeaRS.Connections.Data.ConnectionData.AddBeam(System.Int32,System.Guid,IdeaRS.Connections.Data.ConnectionCmdData)"]
Return Value
Type: ManufacturingOperationData
[Missing <returns> documentation for "M:IdeaRS.Connections.Data.ConnectionData.AddBeam(System.Int32,System.Guid,IdeaRS.Connections.Data.ConnectionCmdData)"]
See Also
Reference
ConnectionData Class
AddBeam Overload
IdeaRS.Connections.Data Namespace